# text = input("შეიყვანეთ ტექსტი: ")
# n = len(text)
# print(f"თქვენს ტექსტში {n} სიმბოლოა")

# text = input("შეიყვანეთ ტექსტი")
# count = text.count('n')

# if count == 0:
#     print("თქვენს ტექსტში ასო n არ არის")
# else:
#     print("თქვენს ტექსტში ასო n", count, "ჯერ გამოდის")


# შექმენით სია სადაც შეინახავთ ნებისმიერ რიცხვებს
numbers = [12, 7.5, 9, 4.2, 15, 20, 3.0, 8]

# გადავიყვანოთ ყველა რიცხვი და შევამოწმოთ, რომელი იყოფა 3-ზე
for num in numbers:
    if num % 3 == 0:
        print(num)