# 1) ახსენით რა არის mutable და immutable?
# Mutable არის მონაცემთა ტიპები, რომელთა შიგთავსის შეცვლა შესაძლებელია ისე, რომ ობიექტის მისამართი (ID) არ შეიცვალოს.
# Immutable: მონაცემთა ტიპები, რომელთა შეცვლა შეუძლებელია. თუ მნიშვნელობას შევუცვლით, შეიქმნება ახალი ობიექტი ახალი მისამართით.



# 2) ახსენით რას აკეთებს len ფუნქცია
# len() ფუნქცია გამოიყენება ობიექტში ელემენტების რაოდენობის დასათვლელად.


# 3) შექმენით ცვლადი სადაც შეინახავთ რაიმე სიტყვას. დაპრინტეთ რამდენი სიმბოლოა ამ სიტყვაში
word = "პროგრამირება"
print(len(word))

# 4) შექმენით ცვლადი სადაც მომხმარებელს შემოაყვანინებთ რაიმე წინადადაებას. დაპრინტეთ სიმბოლოების რაოდენობა ამ წინადადებაში
sentence = input("შემოიყვანეთ წინადადება: ")
print(len(sentence))

# 5) შექმენით სია სადაც შეინახავთ რიცხვებს. for loop ის გამოყენებით დაითვალეთ რამდენი დადებითი და რამდენი უარყოფითი რიცხვია ამ სიაში
numbers = [10, -5, 3, -2, 0, 7, -8]


positives = []
negatives = []


for num in numbers:
    if num > 0:
        positives.append(num)
    elif num < 0:
        negatives.append(num)

print("დადებითი:", len(positives))
print("უარყოფითი:", len(negatives))

# 6) შექმნეით სია სადაც შეინახავთ რიცხვებს. დაითვალეთ რამდენი რიცხვი არის ამ სიაში ისეთი, რომელიც იყოფა 5-ზე
nums = [5, 12, 15, 20, 7, 30]


for i in range(len(nums)):
    if nums[i] % 5 == 0:
        print(nums[i])

# 7) შექმენით სია სადაც შეინახავთ რიცხვებს. დაპრინტეთ მხოლოდ ისეთი რიცხვები, რომლებიც იყოფა 4-ზეც და 7-ზეც
numbers = [28, 14, 56, 4, 7, 84, 100]


for i in range(len(numbers)):
    
    if numbers[i] % 4 == 0 and numbers[i] % 7 == 0:
        print(numbers[i])

# 8) შექმენით სია სადაც შეინახავთ ნებისმიერ მნიშვნელობებს. დაპრინტეთ მხოლოდ ის ელემენტები, რომლებიც იმყოფებიან ლუწ ინდექსზე
mixed_list = ["ა", "ბ", "გ", "დ", "ე", "ვ"]
for i in range(len(mixed_list)):
    if i % 2 == 0:
        print(mixed_list[i])

# 9) შექმენით სია სადაც შეინახავთ სიტყვებს. დაითვალეთ იმ სიტყვების რაოდენობა, რომელთა სიგრძეც მეტია 5-ზე
words = ["ვაშლი", "მსხალი", "ალუბალი", "ატამი", "ფორთოხალი"]
long_words_count = 0
for i in words:
    if len(i) > 5:
        long_words_count += 1
print(long_words_count)

# 10) შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო
text = "გამარჯობა მსოფლიო"
for i in text:
    print(i)

# 11) შექმენით ცვლადი, რომელშიც შეინახავთ რაიმე წინადადებას. for ლუპის გამოყენებით დაპრინტეთ თითოეული სიმბოლო გარდა გამოტოვებისა
text_2 = "ეს არის ტესტი"
for i in text_2:
    if i != " ":
        print(i)

# 12) შექმენით სია სადაც შეინახავთ სიტყვებს. for ლუპის გამოყენებით დაპრინტეთ: 'სიტყვა - სიგრძე'
my_words = ["Python", "css", "C#", "html"]
for word in my_words:
    print(f"{word} - {len(word)}")