#Sequencing არის პროგრამირებაში ინსტრუქციების თანმიმდევრული შესრულება ზემოდან ქვემოთ.
#  კოდის ყველა ხაზი იხორციელება ერთმანეთის შემდეგ, სანამ რაიმე პირობა ან ციკლი არ შეცვლის ნაკადს.

#Selection არის პირობის შემოწმება, რომელიც განსაზღვრავს რომელი კოდის ბლოკი შესრულდება. Python-ში ეს if, elif, else სტრუქტურებით ხორციელდება და საშუალებას გაძლევთ განსხვავებულ მოქმედებას განსხვავებულ შემთხვევებში.

#Python-ში ინდენტაცია სავალდებულოა. ის განსაზღვრავს კოდის ბლოკებს (if, ციკლები, ფუნქციები). ჩვეულებრივ 4 სფეისს იყენებენ, მაგრამ TAB-იც მუშაობს. ინდენტაციის გარეშე კოდი შეცდომას გამოიწვევს.

math = float(input("მათემატიკის ქულა: "))
english = float(input("ინგლისურის ქულა: "))
physics = float(input("ფიზიკის ქულა: "))

if math >= 90 and english >= 90 and physics >= 90:
    print("შესანიშნავი მოსწავლე ხარ")
    print("ყველა საგანში მაღალი შედეგი გაქვს")
elif math >= 70 and english >= 70 and physics >= 70:
    print("კარგი შედეგებია")
    print("სასწავლო წელი წარმატებულია")
elif math < 50 or english < 50 or physics < 50:
    print("ერთ-ერთ საგანში დაბალი ქულა გაქვს")
    print("მეტი სწავლა დაგჭირდება")
else:
    print("შედეგები საშუალოა")
    print("შეგიძლია უკეთესიც")
