#იტერაცია პროგრამირებაში არის ერთი და იმავე ოპერაციის გამეორება კონკრეტულ პირობამდე ან რაოდენობამდე
#ალგორითმი არის მოქმედებების თანმიმდევრობა, რომელიც განსაზღვრავს ზუსტ ნაბიჯებს პრობლემის გადასაჭრელად. მაგ:საკეტის გახსნა: ციფრების კომბინაციების თანმიმდევრული შემოწმება,საჭმლის კეთება რეცეპტით,წიგნის წაკითხვა.
#აღწერის ხერხები:ტექსტური აღწერა (სიტყვებით ნაბიჯების ჩამოთვლა).;ბლოკ-სქემა (გრაფიკული სქემა ისრებით).;პროგრამული კოდი (პროგრამირების ენაზე).

for i in range(25):
    print('for loop')

for i in range(25, 76):
    print(i)


for i in range(40, 91):
    print(i)


for i in range(25, 151, 4):
    print(i)

for i in range(100, 1001, 10):
    print(i)

for i in range(1, 101):
    print(f"{i} პითონი მაგარია")



