# მომხმარებელს შემოატანინე:
# --> ასაკი (age)
# --> სტუდენტია თუ არა (student) – შეიყვანოს "yes" ან "no"
# შემდეგ:
# თუ ასაკი ნაკლებია 12-ზე ან მეტია 65-ზე -> "ბილეთი უფასოა"
# თუ student == "yes" და ასაკი მეტია 12-ზე -> "ბილეთი ნახევარ ფასად"
# სხვა შემთხვევაში -> "სრული ფასი უნდა გადაიხადო"


userage=int(input("შემოიყვანე შენი ასაკი: "))

is_student =input("სტუდენტი ხარ?: ")

if userage<12 or userage>65:
    print("ბილეთი უფასოა ")

elif is_student=="yes" and userage >12:
    print("ბილრთი ნახევარ ფასად ")

else:
    print("სრული ფასი უნდა გადაიხადო ")
  